DROP DATABASE IF EXISTS intro;
CREATE DATABASE IF NOT EXISTS intro
default character set utf8
collate utf8_general_ci;
USE intro;

create table grade
(
    lesson_code varchar(10) not null primary key,
    lesson_name varchar(100) not null,
    lesson_credit int not null,
    seventy_grade double null,
    thirty_exam_grade double null,
    total_grade double null,
    letter_grade varchar(2) null
);

insert into grade values 
	('S.CE102', 'Харилцааны англи хэл', 3, 94.00, 0.00, 94.00, '-A'),
    ('F.CN104', 'Инженерийн эдийн засаг', 3, 64.00, 29.00, 93.00, '-A'),
    ('F.CS101', 'Программчлалын үндэс', 3, 69.00, 26.00, 95.00, '-A'),
    ('F.CS102', 'Мэргэжлийн удиртгал', 2, 100.00, 0.00, 100.00, 'A'),
    ('F.EE101', 'Электроникийн үндэс', 3, 87.00, 0.00, 87.00, 'B'),
    ('S.ML103', 'Хэл ярианы соёл', 3, 70.00, 27.00, 97.00, 'A'),
    ('S.MT101', 'Математик I', 3, 66.00, 20.00, 86.00, 'B'),
    ('S.MT102', 'Математик II', 3, 96.00, 0.00, 96.00, 'A'),
    ('S.PH101', 'Физик I', 3, 68.00, 27.00, 95.00, '-A'),
    ('S.SS102', 'Монголын түүх', 3, 69.00, 28.00, 97.00, 'A'),
    ('S.CD101', 'Гамшгаас хамгаалах менежмент', 1 , 95.00, 0.00, 95.00, '-A'),
    ('F.CS100', 'Алгоритмын үндэс', 3, 70.00, 30.00, 100.00, 'A'),
    ('S.PT101', 'Биеийн тамир', 2, 100.00, 0.00, 100.00, 'A'),
    ('F.CS202', 'Объект хандлагат программчлал', 3, 100.00, 0.00, 100.00, 'A'),
    ('F.CS203', 'Өгөгдлийн бүтэц ба алгоритм', 3, 70.00, 27.00, 97.00, 'A'),
    ('F.CS204', 'Дискрет бүтэц', 3, 61.00, 26.00, 87.00, 'B'),
    ('F.CS211', 'Программ хангамжийн инженерчлэлийн үндэс', 3,70.00, 28.00, 98.00, 'A'),
    ('F.EE202', 'Тоон электроник', 3, 66.00, 28.00, 94.00, '-A'),
    ('F.EE281', 'Микропроцессорын систем', 3, 67.00, 25.00, 92.00, '-A'),
    ('F.IT202', 'Веб зохиомж', 3, 65.00, 28.00, 93.00, '-A'),
    ('F.IT207', 'Хүн ба компьютерийн харилцааны зохиомж', 3, 69.00, 30.00, 99.00, 'A'),
    ('F.IT231', 'Өгөгдлийн сангийн зохиомж', 3, 70.00, 30.00, 100.00, 'A'),
    ('S.MT201', 'Магадлалын онол ба математик статистик', 3, 67.00, 19.00, 86.00, 'B'),
    ('F.CS209', 'Компьютерийн график', 3, 70.00, 30.00, 100.00, 'A'),
    ('F.NS204', 'Компьютерийн сүлжээ I', 3, 70.00, 27.00, 97.00 , 'A'),
    ('F.CS301', 'Үйлдлийн систем', 3, 70.00, 26.00, 96.00, 'A'),
    ('F.CS311', 'Программ хангамжийн бүтээлт', 3, 70.00, 29.00, 99.00, 'A'),
    ('F.CS312', 'Программ хангамжийн шаардлага ба шинжилгээ', 3, 70.00, 30.00, 100.00 , 'A'),
    ('F.IT237', 'Өгөгдлийн сангийн удирдлага', 3, 70.00, 30.00, 100.00, 'A'),
    ('F.CS305', 'Программчлалын хэлний зарчмууд', 3, 70.00, 30.00, 100.00, 'A'),
    ('F.CS317', 'Мобайл программчлал', 3, 63.43, 28.00, 91.43, '-A'),
    ('F.CS322', 'Компьютер хараа', 3, 70.00, 30.00, 100.00, 'A'),
    ('F.CS210', 'Программчлалын дадлага', 2, 100.00, 0.00, 100.00, 'A');

select * from grade;
